Repository: dyxnb22/Luma
Catalog: Sources/LumaCore/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.language.system
source: System Language
zh_hans: 跟随系统

# settings.language.title
source: Language
zh_hans: 语言

# search.empty.typeToSearch
source: Type to search apps, commands, and modules
zh_hans: 输入以搜索应用、命令和模块

# search.empty.help
source: Type help <command> for help (e.g. help clip). clip ? also works.
zh_hans: 输入 help <命令> 查看帮助（如 help clip）。也可使用 clip ?

# search.empty.pressEscClear
source: Press Esc to clear.
zh_hans: 按 Esc 清除。

# search.empty.noItemsInSection
source: No items in %@. Add data or try a more specific query.
zh_hans: %@ 中暂无内容。请添加数据或缩小查询范围。

# search.empty.noMatchesInSection
source: No matches in %@ for “%@”. Check spelling or module settings.
zh_hans: 在 %@ 中未找到 “%@”。请检查拼写或模块设置。

# search.empty.unknownDidYouMean
source: Unknown command “%@”. Did you mean %@?
zh_hans: 未知命令 “%@”。是否指 %@？

# search.empty.unknownHelp
source: Unknown command “%@”. Try help %@ or type ? for all commands.
zh_hans: 未知命令 “%@”。试试 help %@ 或输入 ? 查看全部命令。

# search.empty.globalMinChars
source: Type at least 2 characters for global search, or use a command prefix (clip, note, t).
zh_hans: 全局搜索至少输入 2 个字符，或使用命令前缀（clip、note、t）。

# search.empty.globalNoMatches
source: No matches for “%@”. Enable modules in Settings or try a command prefix.
zh_hans: 未找到 “%@”。请在设置中启用模块或尝试命令前缀。

# search.empty.suggestion
source: Select a suggestion or press Return
zh_hans: 选择建议项或按 Return

# search.placeholder.cheatSheet
source: Search apps, paste, translate, todo, aw…
zh_hans: 搜索应用、剪贴板、翻译、待办、aw…

# home.section.openApps
source: OPEN APPS
zh_hans: 打开应用

# home.guide.title
source: Module entries
zh_hans: 模块入口

# home.guide.col.module
source: Module
zh_hans: 模块

# home.guide.col.trigger
source: Entry
zh_hans: 入口

# home.guide.col.summary
source: Summary
zh_hans: 说明

# home.guide.intro
source: Type a prefix in the search field to open a module or run a command.
zh_hans: 在搜索框输入命令前缀，打开模块或执行命令。

# home.guide.return
source: Return:
zh_hans: 回车：

# home.guide.more
source: More:
zh_hans: 更多：

# home.guide.footer
source: help <trigger> or <trigger> ? for full module help.
zh_hans: 输入 help <入口> 或 <入口> ? 查看完整帮助

# action.appendToNote
source: Append to Note
zh_hans: 追加到笔记

# action.createSnippet
source: Create Snippet
zh_hans: 创建片段

# action.addQuicklink
source: Add Quicklink
zh_hans: 添加快捷链接

# action.copyURL
source: Copy URL
zh_hans: 复制链接

# action.openDailyNote
source: Open Daily Note
zh_hans: 打开每日笔记

# action.openTodo
source: Open Todo
zh_hans: 打开待办

# action.markComplete
source: Mark Complete
zh_hans: 标记完成

# action.openNotesForProject
source: Open Notes
zh_hans: 打开笔记

# action.copyAsPlainText
source: Copy as Plain Text
zh_hans: 复制为纯文本

# action.formatJSON
source: Format JSON
zh_hans: 格式化 JSON

# action.decodeBase64
source: Decode Base64
zh_hans: 解码 Base64

# action.trimWhitespace
source: Trim Whitespace
zh_hans: 去除空白

# action.collapseLines
source: Collapse Lines
zh_hans: 合并行

# action.quoteLines
source: Quote Lines
zh_hans: 引用行

# action.unquoteLines
source: Unquote Lines
zh_hans: 取消引用

# action.copyAsOneLine
source: Copy as One Line
zh_hans: 复制为单行

# action.newProjectSnippet
source: New Project Snippet
zh_hans: 新建项目片段

# action.projectFolderQuicklink
source: Quicklink to Project
zh_hans: 项目快捷链接

# action.editScriptCommands
source: Edit Script Commands
zh_hans: 编辑脚本命令

# status.savedToDailyNote
source: Saved to daily note
zh_hans: 已保存到每日笔记

# status.draftQuicklinks
source: Draft loaded in Quicklinks
zh_hans: 草稿已加载到快捷链接

# status.draftSnippets
source: Draft loaded in Snippets
zh_hans: 草稿已加载到片段

# status.snippetCreated
source: Snippet created
zh_hans: 片段已创建

# status.quicklinkSaved
source: Quicklink saved
zh_hans: 快捷链接已保存

# status.copiedToClipboard
source: Copied to clipboard
zh_hans: 已复制到剪贴板

# status.snippetExpanded
source: Snippet expanded
zh_hans: 片段已展开

# status.notesRootNotConfigured
source: Set a Notes root first
zh_hans: 请先设置笔记根目录

# status.quicklinkTriggerTaken
source: Trigger already in use — pick another
zh_hans: 触发词已被占用

# status.quicklinkURLDuplicate
source: This URL is already saved
zh_hans: 此链接已存在

# status.quicklinkMissingProtocol
source: URL needs http:// or https://
zh_hans: 链接需要 http:// 或 https://

# status.snippetTriggerTaken
source: Trigger already in use — pick another
zh_hans: 触发词已被占用

# status.snippetDuplicateContent
source: Similar snippet already exists
zh_hans: 已有相似片段

# status.snippetSaveFailed
source: Couldn't create snippet
zh_hans: 无法创建片段

# status.quicklinkSaveFailed
source: Couldn't save quicklink
zh_hans: 无法保存快捷链接

# status.noteSaveFailed
source: Couldn't save to daily note
zh_hans: 无法保存到每日笔记

# status.operationFailed
source: Action failed
zh_hans: 操作失败

# status.nothingToCapture
source: Nothing to capture
zh_hans: 没有可捕获的内容

# status.modulesLoading
source: Modules loading…
zh_hans: 模块加载中…

# status.noAlternateActions
source: No alternate actions for this item
zh_hans: 此条目没有备用操作

# status.noActionPanelActions
source: No extra actions — press Return to open
zh_hans: 无额外操作 — 按 Return 打开

# status.noResultsYet
source: No results yet
zh_hans: 暂无结果

# status.clipboardEntryUpdated
source: Clipboard entry updated
zh_hans: 剪贴板条目已更新

# status.replaceSelectionDone
source: Replaced selection in front app
zh_hans: 已替换前台应用中的选中文本

# status.replaceSelectionFailed
source: Couldn't replace selection — grant Accessibility
zh_hans: 无法替换选中文本 — 请授予辅助功能权限

# status.replaceSelectionEmpty
source: No translation to replace with
zh_hans: 没有可替换的译文

# translate.replaceSelection
source: Replace Selection
zh_hans: 替换选中文本

# translate.copyResult
source: Copy Result
zh_hans: 复制结果

# translate.pasteFromClipboard
source: Paste from Clipboard
zh_hans: 从剪贴板粘贴

# translate.detail.placeholder
source: In %@ — Esc to go back
zh_hans: 在 %@ 中 — Esc 返回

# hint.select
source: ↑↓ Select
zh_hans: ↑↓ 选择

# hint.open
source: ↩ Open
zh_hans: ↩ 打开

# hint.more
source: ⇥ More
zh_hans: ⇥ 更多

# hint.escClose
source: Esc Close
zh_hans: Esc 关闭

# hint.escClear
source: Esc Clear
zh_hans: Esc 清除

# hint.detail.back
source: Esc Back ⌘W Close detail
zh_hans: Esc 返回 ⌘W 关闭详情

# commandHint.helpSuffix
source: · Help: help %@
zh_hans: · 帮助: help %@

# detail.delete.confirm
source: Delete
zh_hans: 删除

# detail.delete.cancel
source: Cancel
zh_hans: 取消

# detail.delete.cannotUndo
source: This cannot be undone.
zh_hans: 此操作无法撤销。

# quicklinks.detail.delete.title
source: Delete “%@”?
zh_hans: 删除“%@”？

# media.detail.delete.title
source: Delete “%@”?
zh_hans: 删除“%@”？

# wordbook.manage.delete.title
source: Delete “%@”?
zh_hans: 删除“%@”？

# status.deleteFailed
source: Delete failed.
zh_hans: 删除失败。

# killProcess.cacheRefreshing
source: Refreshing process list…
zh_hans: 正在刷新进程列表…
